Python 3.6.2 (v3.6.2:5fd33b5, Jul  8 2017, 04:57:36) [MSC v.1900 64 bit (AMD64)] on win32
Type "copyright", "credits" or "license()" for more information.
>>> '이해빈'+'은'+'학생이다'
'이해빈은학생이다'
>>> '이해빈'*'은'*'학생임'
Traceback (most recent call last):
  File "<pyshell#1>", line 1, in <module>
    '이해빈'*'은'*'학생임'
TypeError: can't multiply sequence by non-int of type 'str'
>>> '안녕' * 3
'안녕안녕안녕'
\
>>> '안녕 '*100
'안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 안녕 '
>>> def cls():
	print('\n'*5)

>>> cls()






>>> 1<2
True
>>> 3>4
False
>>> 1==2
False
>>> cls()






>>> True
True
>>> False
False
>>> True and True
True
>>> True and False
False

>>> True or False
True
>>> not True
False
>>> not False
True
>>> cls(
	)






>>> 안녕들=['김', '미', '경']
>>> 안녕들
['김', '미', '경']
>>> '김' in 안녕들
True
>>> '산' in 안녕들
False
>>> '산' not in 안녕들
True
>>> 안녕들.append('산')
>>> '산' not in 안녕들
False
>>> 
>>> 
====== RESTART: C:/Users/uos/Desktop/온라인스터디/4시간만에 끝내는 파이썬 기초/day5(2).py ======
반가워요  이해빈
>>> 
====== RESTART: C:/Users/uos/Desktop/온라인스터디/4시간만에 끝내는 파이썬 기초/day5(2).py ======
반가워요 이해빈
>>> 
====== RESTART: C:/Users/uos/Desktop/온라인스터디/4시간만에 끝내는 파이썬 기초/day5(2).py ======
>>> 
====== RESTART: C:/Users/uos/Desktop/온라인스터디/4시간만에 끝내는 파이썬 기초/day5(2).py ======
누구세요?
>>> 
====== RESTART: C:/Users/uos/Desktop/온라인스터디/4시간만에 끝내는 파이썬 기초/day5(2).py ======
당신이 호박이군요!
>>> 
====== RESTART: C:/Users/uos/Desktop/온라인스터디/4시간만에 끝내는 파이썬 기초/day5(2).py ======
반가워요 이해빈
당신이 이해빈이군요!
횟수: 0
횟수: 1
횟수: 2
>>> 
====== RESTART: C:/Users/uos/Desktop/온라인스터디/4시간만에 끝내는 파이썬 기초/day5(2).py ======
반가워요 이해빈
당신이 이해빈이군요!
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0
횟수: 0Traceback (most recent call last):
  File "C:/Users/uos/Desktop/온라인스터디/4시간만에 끝내는 파이썬 기초/day5(2).py", line 16, in <module>
    print('횟수:', count)
KeyboardInterrupt
>>> 
====== RESTART: C:/Users/uos/Desktop/온라인스터디/4시간만에 끝내는 파이썬 기초/day5(2).py ======
반가워요 이해빈
당신이 이해빈이군요!
횟수: 0
횟수: 1
횟수: 2
횟수: 4
횟수: 5
횟수: 6
횟수: 7
횟수: 8
>>> dict={}
>>> dict
{}
>>> type(dict
     )
<class 'dict'>
>>> dict[0]='a'
>>> dict
{0: 'a'}
>>> dict['b']=2
>>> dict
{0: 'a', 'b': 2}
>>> dict['해빈']='하이'
>>> dict
{0: 'a', 'b': 2, '해빈': '하이'}
>>> print(dict['해빈'])
하이
>>> del dict['해빈']
>>> dict
{0: 'a', 'b': 2}
>>> dict[1]='e'
>>> dict
{0: 'a', 'b': 2, 1: 'e'}
>>> dict[1]
'e'
>>> dict.value()
Traceback (most recent call last):
  File "<pyshell#45>", line 1, in <module>
    dict.value()
AttributeError: 'dict' object has no attribute 'value'
>>> for val in dict.values():
	print(val)

	
a
2
e
>>> dict.values()
dict_values(['a', 2, 'e'])
>>> dict.keys()
dict_keys([0, 'b', 1])
>>> dict.items()
dict_items([(0, 'a'), ('b', 2), (1, 'e')])
>>> 
